In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ["Andy", "John", "Tim"],
    "marks": [90, 89, 78],
    "city": ["New York", "London", "Paris"]
}

In [5]:
df = pd.DataFrame(dict1) # df refers to DataFrame which is simply like an excel sheet

In [6]:
df

   name  marks      city
0  Andy     90  New York
1  John     89    London
2   Tim     78     Paris

In [7]:
# Exporting the data to a csv file
df.to_csv('friends.csv') # This will create a csv file in the current directory

In [8]:
# To avoid the index column in the csv file
df.to_csv('friends_noIndex.csv', index=False)

In [9]:
# To display first 2 rows
df.head(2)

   name  marks      city
0  Andy     90  New York
1  John     89    London

In [10]:
# To display bottom 2
df.tail(2)

   name  marks    city
1  John     89  London
2   Tim     78   Paris

In [11]:
df.describe() # This will give the statistical data of the dataframe

           marks
count   3.000000
mean   85.666667
std     6.658328
min    78.000000
25%    83.500000
50%    89.000000
75%    89.500000
max    90.000000

In [16]:
# Reading a csv file
train = pd.read_csv('trains.csv')
train

   Train No.  speed      city
0       1234    120  New York
1       5678    129    London
2       1928     78     Paris
3       2736     93     Paris

In [22]:
# Modify the data
train['speed'][3] = 87
train

/var/folders/cl/x9wrct2x4gbdwtlryyq4tlnw0000gn/T/ipykernel_72504/1201802558.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][3] = 87

   Train No.  speed      city
0       1234    120  New York
1       5678    129    London
2       1928     78     Paris
3       2736     87     Paris

In [23]:
# To write the modified data to a csv file
train.to_csv('trains_modified.csv')

In [24]:
# Read the modified csv:
pd.read_csv('trains_modified.csv')

   Unnamed: 0  Train No.  speed      city
0           0       1234    120  New York
1           1       5678    129    London
2           2       1928     78     Paris
3           3       2736     87     Paris